// Логічні розгалуження:
//     - Є змінна х, якій ви надаєте довільне числове значення.
let x = 0;
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
if (x != 0){
    console.log('Вірно');
}else {
    console.log('Не вірно');
}
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time = 45;
if (time <= 15){
    console.log('перша четверть');
}else if(time > 15 && time <= 30){
    console.log('Друга четверть');
}else if(time > 30 && time <= 45){
    console.log('Третья четверть');
}else if (time > 60){
    console.log('error')
}
else {
    console.log('Четверта четверть');
}
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).
let day = 30;
if (day >= 1 && day <= 10){
    console.log('Перша декада');
}else if(day >= 11 &&  day <= 20){
    console.log('Друга декада')
}else if(day > 20 && day <= 31){
    console.log('Третья декада');
}
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається
// інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (
//         хибноподібні, тобто приводиться до false)
//
//
//     - з файлу arrays.js (лежить в папці 2023 plan ) взяти масив coursesAndDurationArray. За допомоги іф перевірити кожен
//     його елемент на тривалість навчання. У випадку якщо тривалість довша за 5 місяців вивести в консоль "Супер".